# Юлианский календарь
# По заданному числу n от 1 до 365 определите, на какое число какого месяца приходится день
# невисокосного года с номером n.
# Входные данные
# Дано одно целое число n.
# Выходные данные
# Программа должна вывести два числа: число месяца (от 1 до 31) и номер месяца (от 1 до 12),
# соответствующие  дню  с номером n.


n = int(input('введите чмсло: '))

if 1 <= n <= 31:
    a = n, b = 1
elif 32 <= n <= 59:
    a = (n - 31)
    b = 2
elif 60 <= n <= 90:
    a = (n - 59)
    b = 3
elif 91 <= n <= 120:
    a = (n - 90)
    b = 4
elif 121 <= n <= 151:
    a = (n - 120)
    b = 5
elif 152 <= n <= 181:
    a = (n - 151)
    b = 6
elif 182 <= n <= 212:
    a = (n - 181)
    b = 7
elif 213 <= n <= 243:
    a = (n - 212)
    b = 8
elif 244 <= n <= 273:
    a = (n - 243)
    b = 9
elif 274 <= n <= 304:
    a = (n - 273)
    b = 10
elif 305 <= n <= 334:
    a = (n - 304)
    b = 11
elif 335 <= n <= 365:
    a = (n - 334)
    b = 12

print(a, b)

'''
d = {range(1, 32):'1', range(32, 60):'2', range(60, 91):'3', range(91, 121):'4',
     range(121, 152):'5', range(152, 182):'6', range(182, 213):'7', range(213, 244):'8',
     range(244, 274):'9', range(274, 305):'10', range(305, 335):'11', range(335, 366):'12'
    }
k = int(input())
for key in d:
    if k in key:
        print(k - list(key)[0] + 1, d[key])
'''