# Напишите программу на Python для перебора словарей с использованием циклов for

d = {1: 500, 5: 300, 'PPP': 3, '1': 500, 'YYY': 8, 'W': 'nana', 10: 2, 100: 3, 6: 4}

for i in d:
    print(i, ':', d[i])
